# 16) წარმოიდგინე, რომ მუშაობ მონაცემთა ბაზის ადმინისტრატორად და სისტემა გიბრუნებს log-ების (ჩანაწერების) დაუმუშავებელ ტექსტს. შენი მიზანია ამ ერთი ტექსტიდან საჭირო ინფორმაციის ამოღება, შემოწმება და ფორმატირება მოცემული 9 ფუნქციის გამოყენებით.

# log_record = ">ERROR: user MARIAM@COMPANY.GE failed to load the backup file. #backup #Server #backup #urgent"

# 16.1) შეამოწმე, იწყება თუ არა ჩანაწერი ">ERROR:" პრეფიქსით. შედეგი (True ან False) შეინახე ცვლადში და დაბეჭდე: "არის ეს ერორის ლოგი? - True".

# 16.2) შეამოწმე, მთავრდება თუ არა ეს ტექსტი ჰეშთეგით "#urgent". შედეგი არ დაგავიწყდეს და დაბეჭდე.

# 16.3) დათვალე, რამდენჯერ მეორდება ტექსტში ჰეშთეგი "#backup" და დაბეჭდე რაოდენობა.

# 16.4) იპოვე სიტყვა "failed"-ის საწყისი პოზიცია (ინდექსი). თუ ის მოიძებნა, დაბეჭდე მისი ინდექსი.

# 16.5) მოძებნე "@" სიმბოლოს ზუსტი ინდექსი. ამის დახმარებით შენ შეძლებ დაადგინო, სად მთავრდება მომხმარებლის სახელი და სად იწყება დომენი.

# 16.6) დაშალე მთავარი log_record სტრიქონი სივრცეების (space) მიხედვით და შეინახე ახალ ცვლადში (მაგ: words_list). ამის შემდეგ:
# 16.6.1 --> words_list-დან ამოიღე მე-8 სიტყვა და დაბეჭდე ის სულ დიდი ასოებით.
# 16.6.2 --> იმავე სიიდან ამოიღე ელ.ფოსტის მისამართი და გადაიყვანე სრულად პატარა ასოებში, რათა სისტემამ მარტივად აღიქვას. ბოლოს დაბეჭდე ელ.ფოსტა.
# 16.6.3 --> გამოიყენე 16.6.2 ნაბიჯში მიღებული პატარა ასოებიანი ელ.ფოსტა და დაშალე ის @ სიმბოლოს გამოყენებით. აიღე მომხმარებლის სახელი და აქციე ის სტანდარტულ სახელად, სადაც მხოლოდ პირველი ასოა დიდი. დაბეჭდე საბოლოო სახელი.





log_record = ">ERROR: user MARIAM@COMPANY.GE failed to load the backup file. #backup #Server #backup #urgent"
print(log_record.startswith('>ERROR:'))
print(log_record.endswith('#urgent'))
print(log_record.count('#backup'))
print(log_record.find('failed'))
print(log_record.find('@'))
worlds_list = log_record.split()
print(worlds_list[7].upper())
print(worlds_list[2].lower())
print(worlds_list[2].lower().split('@')[0].capitalize())