# 2) კომენტარების სახით ახსენით თუ რა დანიშნულება აქვთ .append(); .insert() და .pop() ფუნქციებს.

# 3) შექმენით რამდენიმე ელენტისგან შემდგარი სია, თქვენი დავალებაა დაბეჭდოთ ამ სიის სიგრძე, ანუ სიაში არსებული ელემენტების რაოდენობა.

# 4) შექმენით ხარიელი სია სადაც მომხმარებელს 5-ჯერ შემოატანინენებთ რიცხვს, შემდეგ კი დაამატებთ მას სიის ბოლოში append() ფუნქციით.

# 5) მოცემულია სია:
# colors = ["red", "green", "blue", "yellow", "purple"]
# თქვენი დავალებაა სიიდან წაშალოთ ბოლო ელემენტი .pop() მეთოდის დახმარებით, შემდეგ კი დაბეჭდოთ განახლებული სია.

# 6) მოცემულია სია:
# animals = ["dog", "cat", "elephant", "lion"]
# თქვენი დავალებაა insert() მეთოდით ჩასვათ სიტყვა "monkey" სიაში მეორე პოზიციაზე, რის შემდეგაც დაბეჭდავთ განახლებულ სიას.

# 7) შემქნით ცარიელი სია, სადაც 3-ჯერ input-ის სახით მომხმარებელს შეაყვანინებთ სამი სტუდენტის სახელს და დაამატებთ სიაში append() ფუნქციით. შემდეგ კი ჩასვით "Teacher" სიის თავში, წაშალეთ ბოლო სტუდენტი და დაბეჭდეთ სიის სიგრძე, ასვეე საბოლოო სია.



# 2) კომენტარების სახით ახსენით თუ რა დანიშნულება აქვთ .append(); .insert() და .pop() ფუნქციებს.
# .append() ით სიის ბოლოში ვამატებთ ახალ მნიშვნელობას .insert() ით ნებისმიერ ინდექსზე ხოლო .pop() ით ნებისმიერი ინდექსის ამოღება შეგვიძლია სიიდან
