# 2) კომენტარებით ახსენით თუ რას აკეთებს .upper(); .lower(); .capitalize(); .find(), .count(), len(), .endswith(), .startswith() ფუნქციები.

# 3) მომხმარებელს შემოატანინეთ წინადადება და დაბეჭდეთ იგი პატარა ასოებით.

# 4) მომხმარებელს შემოატანინეთ ელფოსტის მისამართი და გადაამოწმეთ შეიცავს თუ არა '@' სიმბოლოს, შედეგი კი დაბეჭდეთ დიდი ასოებით.

# 5) მომხმარებელს შემოატანინეთ წიგნის დასახელება და შედეგი დაბეჭდეთ სათაურის სტილში.

# 6) მომხმარებელს შემოატანინეთ წინადადება და სიმბოლო. თქვენი დავალებაა დაითვალოთ რამდენჯერ გვხვდება ეს სიმბოლო წინადადებაში.

# 7) მომხმარებელს შემოატანინეთ სიტყვა და შეამოწმეთ, არის თუ არა იგი დიდი ასოებით, თუ კი — დაბეჭდე "სიტყვა უკვე დიდია!", თუ არა — გადააქციე და დაბეჭდე.




# .upper() გამოიყენება შრიფტის გასადიდებლად .lower() დასაპატარავებლად .capitalize() მხოლოდ პირველი ასოს გასადიდებლად .find() ინდექსის საპოვნელად .count() ითვლის რამდენი ერთი და იგივე ელემენტია ფუნქციაში შეყვანილი len() ითვლის ფუნქციში შეყვანილი ელემენტის სიგრძეს .endswith()ით ვიგებთ მთავრდება თუ არა არგუმენტი მასში ჩაწერილი ელემენტით ხოლო startswith() პირიქით


sentence = input('enter any sentence ')
print(sentence.lower())

