# ) კომენტარებით ახსენით თუ რას აკეთებს .upper(); .lower(); .capitalize(); .find(), .count(), len(), .endswith(), .startswith() ფუნქციები



# .upper() ადიდებს სიტყვაში მოცემულ ყველა ასოს .lower() აპატარავებს სიტყვაში მოცემულ ყველა ასოს .capitalize() ადიდებს სიტყვის მხოლოდ პირველ ასოს .find() პოულობს ელემენტის ინდექსს .count() ითვლის ერთი და იგივე ელემენტების რაოდენობას .len() ით ვიგებთ ელემენტის სიგრძეს  .endswith()ის გამოყენებით ვიგებთ მთავრდება თუ არა რომელიმე ელემენტი მასში მოცემული ელემენტით ხოლო .startswith() პირიქით