# 2) კომენტარებით ახსენით თუ რა არის custom ფუნქციები, რისთვის გამოვიყენებთ და რა დანიშნულება გააჩნიათ, 
# ასევე ახსენით მისი შექმნის გზები ეტაპობრივად და ახსენეთ თუ რაა პარამეტრები და არგუმენტები.

# Custom ფუნქცია არის პროგრამისტის მიერ შექმნილი ფუნქცია რომელიც ასრულებს კონკრეტულ დავალებას იგი გამოიყენება კოდის გამეორების თავიდან ასაცილებლად, პროგრამის უფრო მარტივად გასაგებად, კოდის ხელახლა გამოსაყენებლად და პროგრამის გამოყენებას უფრო ამარტივებს მისი შექმნისთვის ვიყენებთ def შემდეგ ვწერთ ფუნქციას შეგვიზლია ასევე ფრჩხილებში ჩავსვათ პარამეტრები შემდეგ ვიყენებთ ':' და კოდის ქვეშ ინდენტაციით ვწერთ იმ კოდს რომლის მოქმედებაც გვინდა და მას გადავცემთ არგუმენტს. პარამეტრი არის ის ცვლადი რომელიც ფუნქციის ფრჩხილებში იწერება ხოლო არგუმენტი არის ის რაც ფუნქციას გადაეცემა გამოძახების დროს
