# 1) კომენტარებით ახსენით რა არის ფუნქცია
# 2) კომენტარებით ახსენით როგორი ფუნქციაა print() (დღეს გაკვეთილზე ნასწავლიდან გამომდინარე)  
# 3) კომენტარების სახით ახსენით თუ  რაარის find() და რაში ვიყენებთ მას
# 4)  გააკეთეთ 3 მაგალითი find() ის გამოყენებით
# 5) გააკეთეთ  2-2 მაგლითი .upper(), .lower(), .capitalize() ის გამოყენებით




# ფუნქცია არის ბლოკი რომლის გამეორებაც შეგვიძლია და ის ასრლებს კონკრეტულ დავალებებს

# print არის built in ფუნქცია რომელიც გამოიყენება ტერმნალში რაიმის ამოსაბეჭდათ

print('car'. upper())
print('turtle'. upper())
print('MOUSE'. lower())
print('LaPtOp'. lower())
print('davit'. capitalize())
print('time'. capitalize())
print('fruits'.find("i"))
print('human'.find('n'))
print("anatomy".find('o'))
# find() არის ჩაშენებული ფუნქცია პითონში რომლის დახმარებითაც ვპოულობთ ჩვენს გადაცემულ წინადადებაში რომელიმე მოცემულ ინდექსს