# მეტობის ნიშანი > გვეუბნება მეტია თუ არა ერთი ელემენთი მეორეზე (ამტკიცებს მოცემული მაგალითი სწორია თუ არა)
#ნაკლებობის ნიშანი < პირიქით, გვეუბნება თუკი ნაკლებია ერთი რიცხვი მეორეზე 
# == გამოიყენება როდესაც ვაჩვენებთ ტოლობას მეორე ნაირად ამ ინსტრუმენტს მკაცრი ტოლობა ჰქვია რადგან ჯერ ამოწმებს თუკი ნამდვილად ტოლებია რიცხვები შემდეგ კი ამოწმებს იმას თუკი ისინი ერტნაირი ჯგუფის წევრები არიან
# >= გამოიყენება როდესაც ვადგენთ მეტია თ ტოლი ერთი ელემენტი მეორისა 
# <= როგორც მეტია ან ტოლია იგივე ფუნქცია აქვს ამ ხელსაწყოსაც მაგრამ მეტობის მაგივრად ნაკლებობა

print(5 > 3) 
print(10 > 20)
print(9 > 9)
print(90 > 80)
print(80 > 8)


print(10 < 1)
print(89 < 90)
print(100 < 400)
print(78 < 39)
print(45 < 23)


print(1 == 1)
print(5 == '5')
print(9 == 12)
print( 78 == 78)
print(4 == 4)



print(3 >= 2)
print(6 >= 5)
print(89 >= 89)
print(78 >= 80)
print(99 >= 10)




print(5 <= 7)
print(190 <= 190)
print(200 <= 89)
print(16 <= 70)
print(14 <= 90)





# logical operator გამოიყენება იმ შემთხვევაში როდესაც გვინდა დავადგინოთ მოცემულობა ჭეშმარიტია თუ მცდარი და ის შეიცავს ორ ხელსაწყოს and და or ორივეს აქვს 1/3 სიხშირე მაგრამ და ინსტრუმენტის შემთხვევაში სამი მცდარი და ერთი ჭეშმარიტი გამოჩნდება ხოლო ან ინსტრუმენტის გამოყენებისას სამი ჭეშმარიტი და ერთი მცდარი


number = int(input(90))

print(number > 70 )



name = input('davit')
print(name == 'davit')

