# 1) მოცემულია სია: fruits = ["ვაშლი", "ბანანი", "ატამი"]. 
# insert() მეთოდით დაამატე "ფორთოხალი" მეორე ინდექსზე (ანუ მესამე ადგილას)


fruits = ["ვაშლი", "ბანანი", "ატამი"]
fruits.insert(2, 'ფორთოხალი')
print(fruits)



# 2) მოცემულია სია: cars = ["BMW", "Mercedes", "Audi", "Tesla"]. 
# pop() მეთოდით ამოშალე ბოლო ელემენტი და დაბეჭდე განახლებული სია


cars = ["BMW", "Mercedes", "Audi", "Tesla"]
cars.pop(3)
print(cars)



# 3) გაქვს სტუდენტების სია: students = ["ანი", "ლუკა", "ნიკო", "ანი", "მარი"]. 
# count() მეთოდით დათვალე, რამდენჯერ გვხვდება სახელი "ანი" ამ სიაში.

students = ["ანი", "ლუკა", "ნიკო", "ანი", "მარი"]
print(students.count('ანი'))


# 4) მოცემულია ქალაქების სია: cities = ["თბილისი", "ქუთაისი", "ბათუმი", "რუსთავი"]. 
# remove() მეთოდით წაშალე "რუსთავი" სიიდან და დაბეჭდე განახლებული სია.
cities = ["თბილისი", "ქუთაისი", "ბათუმი", "რუსთავი"]
cities.remove('რუსთავი')
print(cities)



# 5) მოცემულია რიცხვების სია: nums = [45, 12, 89, 3, 27]. 
# დაალაგე სია ზრდადობის მიხედვით sort() მეთოდით და დაბეჭდე.\
nums = [45, 12, 89, 3, 27]
nums.sort()
print(nums)


# 6) მოცემულია სია: colors = ["წითელი", "მწვანე", "ლურჯი"]. 
# გამოიყენე index() მეთოდი, რათა გაიგო რომელ ინდექსზეა სიტყვა "მწვანე".
colors = ["წითელი", "მწვანე", "ლურჯი"]
print(colors.index('მწვანე'))


# 7) მომხმარებელს ცალ-ცალკე შემოატანინე 3 საყვარელი კერძი და დაამატე სიაში. 
# ბოლოს დაბეჭდე ანბანის მიხედვით დალაგებული სია.
fav_food = input('შენი საყვარელი კერძი ')
fav_food2 = input('შენი საყვარელი კერძი ')
fav_food3 = input('შენი საყვარელი კერძი ')
food = [fav_food, fav_food2, fav_food3]
food.sort()
print(food)



# 8) მოცემულია სია: languages = ["Python", "JS", "C++", "Java"]. 
# ამოშალე პირველი ელემენტი (ინდექსი 0) pop() მეთოდით.
languages = ["Python", "JS", "C++", "Java"]
languages.pop(0)
print(languages)


# 9) მოცემულია სია: inventory = ["laptop", "mouse", "keyboard", "mouse"]. 
# თუ "mouse" სიაში ერთზე მეტჯერ გვხვდება (გამოიყენე count), ამოშალე მისი პირველი შემთხვევა remove()-ით.|
inventory = ["laptop", "mouse", "keyboard", "mouse"]
if inventory.count('mouse') > 2:
    inventory.remove('mouse')
print(inventory)





