# 2) კომენტარებით ახსენით რა არის სია და როგორ უნდა შევქმნათ ის python-ში.

# სია პითონში არის იგივე რამ რაც ცვლადი მაგრამ ერთის მაგივრად აქ შეგვიძლია შევინახოთ რამდენიმე მნიშვნელობა მათი გამოყენება შესაძლებელია print ის მეშვეობით


# 3) კომენტარებით ახსენით რა არის index-ი.


# ინდექსი არის ელემენტის პოზიცია სიაში





# 4) შექმენით 7 ელემენტიანი სახელების სია, შეცვალეთ 1-ლი და მე-5 ინდექსზე მდგომი ელემენტების მნიშვნელობა.




names = ['davit', 'nika', 'luka', 'lasha', 'nino', 'mari', 'saba']

names[0] = 'nino'
names[4] = 'davit'
print(names)