# 2) შექმენით ცვლადი სადაც შეინახავთ integer ტიპის მონაცემს, შემდეგ შეამოწმეთ თუ ეს რიცხვი რომელიც ცვლადში გაქვთ შენახული მეტია 10 ზე დაპრინტეთ "more than 10" სხვა შემთხვებაში დაპრინტეთ "less than 10"



number = int(input('enter any number '))
if number > 10:
    print('more than 10 ')
else: 
    print('less than 10')

# 3) მომხმარებელს შემოაყვანინეთ რიცხვი, შემდეგ შეამოწმეთ თუ ეს რიცხვი უდრის 15 ს დაუპრინტეთ "equal to 15" სხვა შემთხვევაში დაუპრინტეთ "not equal to 15"



num = int(input('enter random number '))
if num == 15:
    print('equal to 15')
else:
    print('not equal to 15')

# 4) მომხმარებელს შემოატანეთ სტრინგი. შენი დავალებაა შეამოწმო, თუ მომხამრებლის მიერ შემოყვანილი სტრინგი არის group92 დაუპრინტეთ 'you are correct" სხვა შემთხვევაში დაუპრინტეთ "you are wrong"



word = input('enter any str ')
if word == 'group92':
    print('you are correct')
else:
    print('you are wrong')

# 5) დაატრიალეთ for ციკლი 50 დან 100 მდე 5 ის გამოტოვებით



for i in range(50, 105, 5):
    print(i)




# 6) for ციკლის დახმარებით გამოიტანეთ ტერმინალში თქვენი სახელი და გვარი
 
name = input('enter your name ')
for i in range(5):
    print(name)

 # 7) while loop ის დახმარებით ტერმინალში გამოიტანეთ რიცხვები 20 დან 50 მდე


number2 = 20
while number2 <= 50:
    print(number2)
    number2 = number2 + 1






# 8) დაბეჭდეთ 0-დან 100-მდე ყველა რიცხვი. (for-თაც და while-თაც)
# while ვერ
for i in range(0, 100, 1):
    print(i)

# 9) დაბეჭდეთ 0-დან 100-ის ჩათვლით ყველა რიცხვი. (for-თაც და while-თაც)
# while ვერ
for i in range(0, 101, 1):
    print(i)




# 10) დაბეჭდეთ 10-დან 20-მდე ყველე რიცხვი (for-თაც და while-თაც)
# while ვერ
for i in range(9, 20, 1):
    print(i)



#11) დაბეჭდეთ 100-დან 200-ის ჩათვლით ყოველი მე-5 რიცხვი (for-თაც და while-თაც)
# while ვერ


for i in range(100, 205, 5):
    print(i)

#12) დაბეჭდეთ 10-დან 0-ის ჩათვლით ყველა რიცხვი (for-თაც და while-თაც)
# while ვერ

for i in range(10, -1, -1):
    print(i)

 #13) მომხმარებელს შემოაყვანიეთ რაიმე რიცხვი(მთელი/ათწილადი); შეამოწმეთ ეს რიცხვი - 
# --> თუ დადებითია დაპრინტეთ 'ეს რიცხვი დადებითი რიცხვია'
# --> თუ უარყოფითია დაპრინტეთ 'ეს რიცხვი უარყოფითი რიცხვია'
# --> თუ ნულია დაპრინტეთ 'ეს რიცხვი ნულია'




num1 = int(input('enter any number '))
if  num1 > 0:
    print('ეს რიცხვი დადებითი რიცხვია ')
elif num1 == 0:
    print('ეს რიცხვი ნულია')
else:
    print('ეს რიცხვი უარყოფითი რიცხვია ')




#15) მომხმარებელს შემოატანიეთ სამი რიცხვი(მთელი/ათწილადი) და ამ სამი რიცხვთაგან დაბეჭდეთ უდიდესი

# stuck
n = int(input('enter any number '))



# 16) შემოატანიეთ მომხმარებელს რიცხვი 1-დან 7-ჩათვლით
# თუ 1 --> დაპრინტეთ 'ორშაბათი'
# თუ 2 --> დაპრინტეთ 'სამშაბათი'
# თუ 3 --> დაპრინტეთ 'ოთხშაბათი'
# თუ 4 --> დაპრინტეთ 'ხუთშაბათი'
# თუ 5 --> დაპრინტეთ 'პარასკევი' 
# თუ 6 --> დაპრინტეთ 'შაბათი'
# თუ 7 --> დაპრინტეთ 'კვირა' 
# სხვა დანარჩენი --> 'არ ვიცი ეგ რა დღეა'






#17) მომხმარებელს შემოატანინეთ რიცხვი, თუ ის მეტია 50-ზე დაბეჭდეთ ეს რიცხვი გამრავლებული 5-ზე, სხვა შემთხვევაში დაბეჭდეთ ეს რიცხვი კვადრატში.


enter_number = int(input('enter any number '))

if enter_number > 50:
    print(enter_number * 5)
else:
    print(enter_number ** 2)





# 18) მომხმარებელს შემოატანინეთ პაროლი თუ ის უდრის მაგალითად "goa123"-ს დაბეჭდეთ "Password is correct!", სხვა შემთხვევაში დაბეჭდეთ "Incorrect password!"

password = input('enter password ')
if password == 'goa123':
    print('password is correct')
else:
    print('incorrect password ')




 # 19) მომხმარებელს შემოატანინეთ რიცხვი და დაბეჭდეთ 1-დან შემოტანილის ჩათვლით ყველა რიცხვის ჯამი.

# 20) შექმენით ლოტოს გათამაშების სიმულაცია. პროგრამამ უნდა გადაამოწმოს ბილეთის ნომრები 1-დან 5000-მდე. თუ ციკლი მივა რიცხვამდე 2024 (მომგებიანი ბილეთი), უნდა დაბეჭდოს „ჯეკპოტი! მომგებიანი ბილეთი ნაპოვნია“ და დაუყოვნებლივ დაასრულოს მუშაობა (გაწყვიტოს ციკლი)






# 21) თქვენი დავალებაა შექმნათ 1-დან 300-მდე რიცხვების ჩამონათვალი. ამ დიაპაზონში უნდა იპოვოთ პირველივე რიცხვი, რომელიც ერთდროულად უნაშთოდ იყოფა 4-ზეც და 7-ზეც. როგორც კი იპოვით ასეთ რიცხვს, დაბეჭდეთ ის ეკრანზე და დაასრულეთ ციკლის მუშაობა.

# 22) დაწერეთ პროგრამა, რომელიც დაბეჭდავს რიცხვებს 1-დან 50-მდე. თუმცა, პირობა ისეთია, რომ პროგრამამ არ უნდა დაბეჭდოს ის რიცხვები, რომლებიც უნაშთოდ იყოფა 10-ზე (ანუ 10, 20, 30...). გამოიყენეთ ისეთი ოპერატორი, რომელიც ციკლს ამ კონკრეტულ ბიჯებს გამოატოვებინებს და გააგრძელებს მუშაობას.