# 1) კომენტარებით ახსენით რა არის ფუნქცია
# 2) კომენტარებით ახსენით როგორი ფუნქციაა print() (დღეს გაკვეთილზე ნასწავლიდან გამომდინარე)  
# 3) კომენტარების სახით ახსენით რა არის არგუმენტები
# 4) კომენტარების სახით ახსენით თუ რასაკეტებს .upper(), .upper(), .capitalize()
# 5) გააკეთეთ 2-2 მაგალითი .upper() .lower() .capitalize() ების გამოყენებით
# 6) კომენტარების სახით ახსენით თუ რასაკეთებს find() და გააკეთეთ 2 მაგალითი find() ის გამოყენებით



#  ფუნქცია არის კოდის ბლოკი რომელიც ასრულებს შესაბამის დავალებებს მრავალჯერ

# ის არის ჩაშენებული ფუნქცია რრომელსაც გამოვიყენებთ ტერმინალში რაიმე ინფორმაციის გამოსატანათ

# არგუმენტი არის ფუნციაში ჩაწერილი ელემენტი

# upper() ფუნქციაში შეყვანილი ელემენტის ასოებს ადიდებს lower()  აპატარავებს და capitalize() მხოლოდ პირველი სიტყვის პირველ ასოს ადიდებს

print("dog". upper())
print('CAT'. lower())
print('animal'. capitalize())

print("hello world".find("l"))

